---
kind: type
id: T:Autodesk.Revit.DB.Visual.AssetPropertyFloat
source: html/06a74248-8273-987b-bd05-b59736b60372.htm
---
# Autodesk.Revit.DB.Visual.AssetPropertyFloat

Represents a property of material.

## Syntax (C#)
```csharp
public class AssetPropertyFloat : AssetProperty
```